{"_id":"note:XLiE2yuU7","title":"2. 5 Planes of UX","content":"## UX DESIGN\n\n* * *\n\n### 1\\. Strategy\n\n##### User Stories:\n\n- **External Users** Hobbyists, through to learning and budding developers.\n    \n    1.  As an aspiring developer:\n        - I want to play with styles to see what works and what doesn't work.\n        - I want to see how the different style attributes work.\n        - I want to see how to write CSS for buttons.\n        - I want to create button styles on the fly to save time.\n        - I want to learn how to design buttons.\n    2.  As a hobbyist who likes to dabble with HTML and CSS:\n        - I want to enjoy playing and be able to create buttons easily.\n        - I want to see the result as I create it to know what I will have.\n    3.  As a developer:\n        - I'm always looking and open to trying tools to make my work more efficient and save me time.\n        - I want to be able to enter colors that I am working with to easily create buttons that fit within the colors of my project.\n        - I want to be able to play with designs and effects, and colors to discover what is possible.\n- **The Owner** That would be me in this case.\n    \n    1.  As the owner:\n        - I want to have a tool that makes my job easier.\n        - I want to create a tool that I have used online before, but that does things I want it to do.\n        - I want to create it to my design preferences and to be able to change it when I want to.\n        - I want to be able to add to it and to expand it to improve it.\n        - I want to share this tool with others who might also benefit from it.\n        - I want to do this project to learn and to be able to put to use the things I have been learning in this last unit.\n\n### 2\\. Scope\n\nHaving played on a few of these sorts of sites myself, I know what I find interesting. Also, what makes it an experience to which I would return. Given the limit on time and the abundance of ideas, my challenge is to confine the project's scope to submit it in time.\n\nCentral to the site will be a playground of features to add styling to buttons.\n\n- **Required Features**\n    \n    - **Color picker feature** \\- Users can select colors for the different attributes of the button.\n    - **Color Format** \\- Users will be able to enter the color in a text input, in preferred format HEX, RGB/A, HSL/A.\n    - **Range Selector** \\- For selecting the size, pixels, distance, etc.\n    - **Toggle Switch** \\- A converted checkbox displayed as a toggle switch for enabling or disabling form fields.\n    - **Gradient Selector** \\- Gradients are becoming the norm, supported in all modern browsers. A feature is needed for users to choose gradients.\n    - **Social Icons** \\- The icons will link to my GitHub, Codepen, and Linkedin profiles.\n    - **Contact Form** \\- Users can contact me by using the contact form.\n    - **Modal** \\- The Modal will be for the contact form so I can keep the site to one page.\n    - **Navbar** \\- Navabar will house the social icons.\n    - **Offcanvas navbar** \\- An off-canvas that can be toggled open at any time, not only for small screens.\n    - **Accordion** \\- It will have forms of inputs grouped so that users can style the demo button.\n    - **Demo button** \\- A demo button to show the styling results visually.\n    - **CSS display** \\- An CSS output display that will update as the user styles the button.\n    - **Copy to clipboard** \\- A button for users to copy the CSS style.\n    - **Footer** \\- Simple Footer with the social links from the Navbar replicated, as above so below.\n- **Functional Requirements**\n    \n    - **Color Pickers** \\- Will open when clicked and will have an input so users can enter a specific color if they want. They can also use the mouse cursor to select a color. Form inputs have set default values, so there is a designed button to start.\n    - **Range Selectors** \\- The value will be displayed when the user changes it. As a guide, I will set default minimum and maximum values for different attributes for the user.\n    - **Toggle Switches** \\- Users will be able to disable or enable some fields of inputs to include or exclude them from the button styling. Not everyone likes a pizza with the works.\n    - **Navbar** \\- Fixed Navbar, with a toggle button so users will be able to open the off-canvas and see a list of valuable resources.\n    - **Copy to clipboard** \\- Users will be able to copy the CSS style easily, and there will be visual feedback to confirm the Copy is successful.\n    - **Gradients** \\- Users will be able to select colors to create gradients. A start color, end color, and a direction are required to compile CSS rules for cross-browser compatibility.\n    - **Contact form** \\- Users can access the contact form from the Navbar or Footer. Clicking on the email icon will open the modal with the contact form. It will include validation, and they will be able to send a message. A message will inform the user of the message submission's success or failure.\n    - **Accordion** \\- There will be multiple levels of forms containing fieldsets of grouped inputs providing values to compile CSS rules. The user will work through the different style attributes and see the result live as they change the style values. The Accordion will have one Form open at a time\n    - **Demo button** \\- The user will add their button text, colors, style attributes by changing the values of the form inputs. The change in values will be updated live to the demo button. The user can change the button's background color to see how it looks against the intended background color.\n    - **CSS Output display** \\- The CSS markup will be output into a display next to the Form and below the button.\n- **Content Requirements**\n    \n    - **Single page site** \\- Keeping it simple with a one-page site, not overcooked with content. The button styling will be the central focus.\n    - **Bling** \\- There will be a full-width banner image to welcome the site user.\n    - **Forms within the Accordion** \\- Inputs grouped by CSS rule into fieldsets, laid out sequentially so users can intuitively work through them.\n    - **CSS Markup Block** \\- A block within `<pre><code></code></pre>` tags to display the CSS output from selected CSS rules.\n    - **Instructions** \\- Simple instructions for users, explaining how easy it is to create, copy, and use the style creator.\n\n**Required Form Elements**\n\n- [ ] **Color picker:**\n    \n    - [ ] It was a process to research and select a color picker. There are many around, with varying degrees of documentation, and each has its pros and cons. In the end, my choice was the [jscolor color picker](https://jscolor.com/). It is well documented and has lots of examples showing different possibilities and how to configure them. They are very friendly and offer great support if you have any questions.\n- [ ] **Range Selector:**\n    \n    - [ ] I found some great examples on [CSS Tricks](https://css-tricks.com/value-bubbles-for-range-inputs/) showing different ways to style range inputs and to output the value as it changes. I used one of these in my formes, with some minor changes to the CSS.\n- [ ] **Toggle Switch:**\n    \n    - [ ] I have little experience or knowledge about this element. It's my preferred option to disable form field groups, so users can easily choose styling they want to include. I found the [Bootstrap Switch Button](https://gitbrent.github.io/bootstrap4-toggle/#usage) API available on Github. There is a working example on Codepen with the Bootstrap Range Selector.\n- [ ] **Select:**\n    \n    - [ ] This is pretty straightforward and easy to incorporate. I will use the [Bootstrap Select](https://getbootstrap.com/docs/5.0/forms/select/).\n- [ ] **Text Input:**\n    \n    - [ ] The Form will contain only one text input for entering the button text.\n\n### 3\\. Structure\n\n- **Interaction Design**\n    \n    - I think it is human nature to be curious and to want to explore. My vision is that the site will engage and invite exploration to discover available features. It's meant to be an intuitive and joyful experience. Color has a powerful impact on feeling and emotion, so this will be a playground for exploring colors.\n    - There will be color pickers, range selectors, fonts, a variety of features to tweak the color, size, and style of the buttons to see how the CSS is output.\n    - The user will be able to play, create a button, and easily copy it to be able to use the exact style where they want to use it.\n- **Information Architecture** Site information arranged as follows.\n    \n    - ***Simple and sweet:*** Home page will be colorful. The center point is the forms with inputs for styling the demo button, a playground full of possibilities.\n    - ***Contact Form*** I want it simple and don't want users to navigate away from the reason that brought them to the site. So it will be a one-page site, with a contact form at the bottom of the page. I may put the contact form in a modal if, for some reason, it doesn't fit on the home page.\n    - ***Social Links*** There will be social links for connecting to me or viewing my work on GitHub, Codepen, and Linkedin.\n    - ***Planning*** Given the number of CSS rules to be generated, and corresponding inputs to create the data for outputting the CSS, I have created an excel sheet to use as I put the forms together.\n    - ***Layout*** The Layout should be such that the button is visible along with the CSS output so the user can see the result as they change the styles.\n\n### 4\\. Skeleton\n\n- **Wireframing:**\n    As I'm be using Bootstrap, I created the wireframes with the Bootstrap breakpoints in mind for small, medium, and large screens. The header row will have a responsive background image. Next comes the row with form block and CSS display block. Followed then by a content block and then the Footer.\n    I put the contact form in the Footer in the wireframes. However, in the end, I decided to put it in a modal that opens when you click on the email icon. \n    I combined the three separate wireframes into one image for the README as seeing them side by side gives a better perspective of the scale of difference between the different size screens. The original size wireframes are available for viewing in the assets/images folder. \n \n![Wireframes](assets/images/wireframes.png)\n\n### 5\\. Surface\n\n**Visual Design:**\nColor. Fun. Exploration. I want to take off my conservative hat and be a little daring to create an impression, definitely an experience to remember. It should be a fun experience to play with the button creator, one that the user will remember and return to when they next need to check out button styles.","tags":[],"folderPathname":"/","data":{},"createdAt":"2021-04-20T15:33:05.736Z","updatedAt":"2021-04-20T15:33:30.131Z","trashed":false,"_rev":"58Zbcuzkr"}